ThuanLeUte/nrf52832-ads1292-fw/app/project/ble_peripheral/ble_app_template/main.c
    case SH2_SHAKE_DETECTOR:
    {
      NRF_LOG_INFO("Shake Detector - shake detected on axis: ");
      sh2_ShakeDetector_t detection = sensor_value.un.shakeDetector;
      switch (detection.shake)
      {
      case SHAKE_X:
        NRF_LOG_INFO("X");
        break;
      case SHAKE_Y:
        NRF_LOG_INFO("Y");
        break;
      case SHAKE_Z:
        NRF_LOG_INFO("Z");
        break;
      default:
        NRF_LOG_INFO("None");
        break;
      }
    }

    case SH2_PERSONAL_ACTIVITY_CLASSIFIER:
    {
      sh2_PersonalActivityClassifier_t activity = sensor_value.un.personalActivityClassifier;

      NRF_LOG_INFO("Activity classification - Most likely: ");
      printActivity(activity.mostLikelyState);

      NRF_LOG_INFO("");
      NRF_LOG_INFO("Confidences:");

      // If PAC_OPTION_COUNT is ever > 10, we'll need to care about page
      for (uint8_t i = 0; i < PAC_OPTION_COUNT; i++)
      {
        printActivity(i);
        NRF_LOG_INFO(": ");
        // NRF_LOG_INFO(activity.confidence[i]);
      }
    }
    }
  }
}

/**
 * @brief         Function for assert macro callback.
 *
 * @param[in]     line_num     Line number of the failing ASSERT call.
 * @param[in]     p_file_name  File name of the failing ASSERT call.
 *
 * @attention     None
 *
 * @return        None
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/* Private function definitions --------------------------------------- */
/**
 * @brief         Function for initializing the timer module.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void timers_init(void)
{
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

  // Create timers.
  err_code = app_timer_create(&m_sensors_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              sensors_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);

  err_code = app_timer_create(&m_battery_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              battery_level_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);

  err_code = app_timer_create(&m_led_blink_timer_id,
                              APP_TIMER_MODE_REPEATED,
                              led_blink_timeout_handler);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for the GAP initialization.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void gap_params_init(void)
{
  uint32_t                err_code;
  ble_gap_conn_params_t   gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
                                        (const uint8_t *)DEVICE_NAME,
                                        strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency     = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for handling Queued Write Module errors.
 *
 * @param[in]     nrf_error   Error code containing information about what went wrong.
 *
 * @attention     None
 *
 * @return        None
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}

/**
 * @brief         Function for ACS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void acs_service_init(void)
{
  uint32_t           err_code;
  ble_acs_init_t     acs_init;

// Initialize ACS
  memset(&acs_init, 0, sizeof(acs_init));

  acs_init.evt_handler          = NULL;
  acs_init.support_notification = true;
  acs_init.p_report_ref         = NULL;

  acs_init.bl_rd_sec        = SEC_OPEN;
  acs_init.bl_cccd_wr_sec   = SEC_OPEN;
  acs_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_acs_init(&m_acs, &acs_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for ECG service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void ecg_service_init(void)
{
  uint32_t           err_code;
  ble_ecg_init_t     ecg_init;

  // Initialize ECG
  memset(&ecg_init, 0, sizeof(ecg_init));

  ecg_init.evt_handler          = NULL;
  ecg_init.support_notification = true;
  ecg_init.p_report_ref         = NULL;

  ecg_init.bl_rd_sec        = SEC_OPEN;
  ecg_init.bl_cccd_wr_sec   = SEC_OPEN;
  ecg_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_ecg_init(&m_ecg, &ecg_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for ECG service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void sts_service_init(void)
{
  uint32_t           err_code;
  ble_sts_init_t     sts_init;

  // Initialize ECG
  memset(&sts_init, 0, sizeof(sts_init));

  sts_init.evt_handler          = NULL;
  sts_init.support_notification = true;
  sts_init.p_report_ref         = NULL;

  sts_init.bl_rd_sec        = SEC_OPEN;
  sts_init.bl_cccd_wr_sec   = SEC_OPEN;
  sts_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_sts_init(&m_sts, &sts_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for GYS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void gys_service_init(void)
{
  uint32_t           err_code;
  ble_gys_init_t     gys_init;

// Initialize GYS
  memset(&gys_init, 0, sizeof(gys_init));

  gys_init.evt_handler          = NULL;
  gys_init.support_notification = true;
  gys_init.p_report_ref         = NULL;

  gys_init.bl_rd_sec        = SEC_OPEN;
  gys_init.bl_cccd_wr_sec   = SEC_OPEN;
  gys_init.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_gys_init(&m_gys, &gys_init);
  APP_ERROR_CHECK(err_code);
}

/**
 * @brief         Function for MGS service init
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void mgs_service_init(void)
{
  uint32_t           err_code;
  ble_mgs_init_t     mgs_init;

